# libraries

In [46]:
pip install pyarrow

Requirement already satisfied: pyarrow in c:\users\axelm\anaconda3\lib\site-packages (16.1.0)
Requirement already satisfied: numpy>=1.16.6 in c:\users\axelm\anaconda3\lib\site-packages (from pyarrow) (1.23.5)
Note: you may need to restart the kernel to use updated packages.

In [47]:
pip install fastparquet

Requirement already satisfied: fastparquet in c:\users\axelm\anaconda3\lib\site-packages (2024.5.0)
Requirement already satisfied: cramjam>=2.3 in c:\users\axelm\anaconda3\lib\site-packages (from fastparquet) (2.8.3)
Requirement already satisfied: pandas>=1.5.0 in c:\users\axelm\anaconda3\lib\site-packages (from fastparquet) (1.5.3)
Requirement already satisfied: packaging in c:\users\axelm\anaconda3\lib\site-packages (from fastparquet) (22.0)
Requirement already satisfied: numpy in c:\users\axelm\anaconda3\lib\site-packages (from fastparquet) (1.23.5)
Requirement already satisfied: fsspec in c:\users\axelm\anaconda3\lib\site-packages (from fastparquet) (2022.11.0)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\axelm\anaconda3\lib\site-packages (from pandas>=1.5.0->fastparquet) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\axelm\anaconda3\lib\site-packages (from pandas>=1.5.0->fastparquet) (2022.7)
Requirement already satisfied: six>=1.5 in c:\users\axelm\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas>=1.5.0->fastparquet) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [48]:
import pandas as pd
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)
pd.set_option('display.float_format', '{:.2f}'.format)

# reading csv

In [49]:
customers = pd.read_csv('C:\\Users\\axelm\\OneDrive\\Documentos\\python\\Datos necesarios\\customers.csv')
customers.head(10)

   customer_id                                       type
0       383249                            Hogar con Venta
1       249859                     Estanquillos / kioscos
2       106498                     Estanquillos / kioscos
3       385264  Abarrotes / Almacenes / Bodegas / Víveres
4       165442                     Estanquillos / kioscos
5       275395                     Estanquillos / kioscos
6       147449                            Hogar con Venta
7       382939                     Estanquillos / kioscos
8       345755                            Hogar con Venta
9       175659                     Farmacia Independiente

In [50]:
sales = pd.read_csv('C:\\Users\\axelm\\OneDrive\\Documentos\\python\\Datos necesarios\\sales.csv')
sales.head(10)

   customer_id   month  amount  churn_next_month
0       100000  202102   48.07              0.00
1       100000  202306   40.30              0.00
2       100000  202308   32.90              0.00
3       100000  202207   50.72              0.00
4       100000  202212   47.87              0.00
5       100000  202010   84.43              0.00
6       100000  202107   75.96              0.00
7       100000  202110   92.41              0.00
8       100000  202008   37.66              0.00
9       100000  202009   50.07              0.00

In [51]:
sub = pd.read_csv('C:\\Users\\axelm\\OneDrive\\Documentos\\python\\Datos necesarios\\team_XX_submissions.csv')
sub.head(10)

   customer_id   month  churn_next_month
0          123  202311                 0
1          124  202311                 1

# checking sales

In [52]:
len(sales)

5386175

In [53]:
sales.isna().sum()

customer_id             0
month                   0
amount                  0
churn_next_month    94272
dtype: int64

In [54]:
len(set(sales['customer_id']))

170367

In [55]:
sales.describe()

       customer_id      month     amount  churn_next_month
count   5386175.00 5386175.00 5386175.00        5291903.00
mean     250112.72  202139.33     215.23              0.01
std       86654.30     116.40     299.69              0.12
min      100000.00  201911.00    -343.77              0.00
25%      174945.50  202011.00      54.31              0.00
50%      250360.00  202110.00     130.96              0.00
75%      325280.00  202210.00     275.67              0.00
max      399999.00  202311.00   24286.95              1.00

In [56]:
len(sales[sales.amount < 0])

107

In [57]:
sales[sales.amount < 0].head()

        customer_id   month  amount  churn_next_month
44694        102503  202205   -0.09              1.00
99026        105528  202302   -0.72              0.00
119379       106607  202207   -0.00              1.00
148344       108253  202210   -0.00              1.00
204773       111343  202203   -0.00              0.00

In [58]:
sales['month'] = sales['month'].astype(str)

sales['year'] = sales['month'].str[:4]
sales['month'] = sales['month'].str[4:]

sales['month'] = sales['month'].astype(int)
sales['year'] = sales['year'].astype(int)

sales.head()

   customer_id  month  amount  churn_next_month  year
0       100000      2   48.07              0.00  2021
1       100000      6   40.30              0.00  2023
2       100000      8   32.90              0.00  2023
3       100000      7   50.72              0.00  2022
4       100000     12   47.87              0.00  2022

In [59]:
len(sales[sales.churn_next_month == 0])

5219095

In [60]:
len(sales[sales.churn_next_month == 1])

72808

In [61]:
len(customers)

169671

In [62]:
len(set(customers['customer_id']))

169671

# creating full db

In [63]:
full_db = pd.merge(sales, customers, on='customer_id', how='left')
full_db.head()

   customer_id  month  amount  churn_next_month  year                    type
0       100000      2   48.07              0.00  2021  Estanquillos / kioscos
1       100000      6   40.30              0.00  2023  Estanquillos / kioscos
2       100000      8   32.90              0.00  2023  Estanquillos / kioscos
3       100000      7   50.72              0.00  2022  Estanquillos / kioscos
4       100000     12   47.87              0.00  2022  Estanquillos / kioscos

In [64]:
full_db.to_parquet('base combinada.parquet', index=False)

In [65]:
full_db['type'].unique().tolist()

['Estanquillos / kioscos',
 'Abarrotes / Almacenes / Bodegas / Víveres',
 'Hogar con Venta',
 'Carnicería / Pollería / Pescadería',
 'Minisuper / Minimarket',
 'Cerveza y Licores',
 'Frutas y Verduras',
 'Tiendas de Alimentos Especializados Orgánicos',
 'Tortillería',
 'Mayorista Abarrotero',
 nan,
 'Panadería / Pastelería',
 'Farmacia Independiente',
 'TDC/Proximidad Independiente']

In [66]:
full_db.describe()

       customer_id      month     amount  churn_next_month       year
count   5386175.00 5386175.00 5386175.00        5291903.00 5386175.00
mean     250112.72       6.58     215.23              0.01    2021.33
std       86654.30       3.48     299.69              0.12       1.17
min      100000.00       1.00    -343.77              0.00    2019.00
25%      174945.50       4.00      54.31              0.00    2020.00
50%      250360.00       7.00     130.96              0.00    2021.00
75%      325280.00      10.00     275.67              0.00    2022.00
max      399999.00      12.00   24286.95              1.00    2023.00

# stats

In [67]:
clean_db = full_db[full_db.amount >= 0]

In [68]:
clean_db.isna().sum()

customer_id             0
month                   0
amount                  0
churn_next_month    94269
year                    0
type                  696
dtype: int64

In [69]:
clean_db.describe()

       customer_id      month     amount  churn_next_month       year
count   5386068.00 5386068.00 5386068.00        5291799.00 5386068.00
mean     250112.60       6.58     215.23              0.01    2021.33
std       86654.23       3.48     299.69              0.12       1.17
min      100000.00       1.00       0.00              0.00    2019.00
25%      174946.00       4.00      54.31              0.00    2020.00
50%      250360.00       7.00     130.96              0.00    2021.00
75%      325275.00      10.00     275.67              0.00    2022.00
max      399999.00      12.00   24286.95              1.00    2023.00

In [75]:
clean_db = clean_db[~clean_db['churn_next_month'].isnull()]

clean_db.isna().sum()

customer_id         0
month               0
amount              0
churn_next_month    0
year                0
type                0
dtype: int64

In [76]:
len(clean_db)

5291799